ComunesGeneradorReporte/src/META-INF/wsdl/SrvScnNotificacionesMail/v1_1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.6hudson-86  svn-revision#12773.--><!--Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.6hudson-86  svn-revision#12773.--><definitions targetNamespace="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1" name="v1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1" schemaLocation="v1.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ContextoRespuestaTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18_19.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/TerminalTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/CriterioOrdenamientoTipo/v1" schemaLocation="v1_1_2.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/AplicacionTipo/v1" schemaLocation="v1_1_2_3_4_5_6.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/UbicacionPersonaTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Persona/PersonaNaturalTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/PersonaTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/TelefonoTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/OperacionCanalTipo/v1" schemaLocation="v1_1_2_3_4.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/HuellaDigitalDispositivoTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Persona/ClienteNaturalTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ContextoSolicitudTipo/v1" schemaLocation="v1_1.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ErrorTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18_19_20_21.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/DepartamentoTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ContactoTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/PreguntaSeguridadTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18_19_20_21_22.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/TokenTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18_19_20_21_22_23.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/MunicipioTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/CanalTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ServicioTipo/v1" schemaLocation="v1_1_2_3.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ResultadoTransaccionTipo/v1" schemaLocation="v1_1_2_3_4_5_6_7_8_9_10_11_12_13_14_15_16_17_18_19_20.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.davivienda.com/Esquemas/Framework/ConsumidorTipo/v1" schemaLocation="v1_1_2_3_4_5.xsd"/>
    </xsd:schema>
  </types>
  <message name="opEnviarMail">
    <part name="msjSolOpEnviarMail" element="tns:msjSolOpEnviarMail"/>
  </message>
  <message name="opEnviarMailResponse">
    <part name="msjRespOpEnviarMail" element="tns:msjRespOpEnviarMail"/>
  </message>
  <portType name="portSrvScnNotificacionesMailSOAP">
    <operation name="opEnviarMail">
      <input wsam:Action="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1/opEnviarMail" message="tns:opEnviarMail"/>
      <output wsam:Action="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1/portSrvScnNotificacionesMailSOAP/opEnviarMailResponse" message="tns:opEnviarMailResponse"/>
    </operation>
  </portType>
  <binding name="portSrvScnNotificacionesMailSOAPBinding" type="tns:portSrvScnNotificacionesMailSOAP">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="opEnviarMail">
      <soap:operation soapAction="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1/opEnviarMail"/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="v1">
    <port name="portSrvScnNotificacionesMailSOAP" binding="tns:portSrvScnNotificacionesMailSOAPBinding">
      <soap:address location="http://localhost:7001/SrvScnNotificacionesMail-war/v1"/>
    </port>
  </service>
</definitions>