recursos/xml/ReqNotificacionesMail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1" xmlns:v11="http://www.davivienda.com/Esquemas/Framework/ContextoSolicitudTipo/v1" xmlns:v12="http://www.davivienda.com/Esquemas/Framework/ServicioTipo/v1" xmlns:v13="http://www.davivienda.com/Esquemas/Framework/OperacionCanalTipo/v1" xmlns:v14="http://www.davivienda.com/Esquemas/Framework/ConsumidorTipo/v1" xmlns:v15="http://www.davivienda.com/Esquemas/Framework/AplicacionTipo/v1" xmlns:v16="http://www.davivienda.com/Esquemas/Framework/CanalTipo/v1" xmlns:v17="http://www.davivienda.com/Esquemas/Framework/TerminalTipo/v1" xmlns:v18="http://www.davivienda.com/Esquemas/Framework/HuellaDigitalDispositivoTipo/v1" xmlns:v19="http://www.davivienda.com/Esquemas/Framework/CriterioOrdenamientoTipo/v1" xmlns:v110="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1" xmlns:v111="http://www.davivienda.com/Esquemas/Framework/PersonaTipo/v1" xmlns:v112="http://www.davivienda.com/Esquemas/Framework/ContactoTipo/v1" xmlns:v113="http://www.davivienda.com/Esquemas/Framework/TelefonoTipo/v1" xmlns:v114="http://www.davivienda.com/Esquemas/Framework/UbicacionPersonaTipo/v1" xmlns:v115="http://www.davivienda.com/Esquemas/Framework/MunicipioTipo/v1" xmlns:v116="http://www.davivienda.com/Esquemas/Framework/DepartamentoTipo/v1" xmlns:v117="http://www.davivienda.com/Esquemas/Persona/PersonaNaturalTipo/v1" xmlns:v118="http://www.davivienda.com/Esquemas/Persona/ClienteNaturalTipo/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:msjSolOpEnviarMail>
         <v1:contextoSolicitud>
            <v11:servicio>
               <v12:idServicio>?</v12:idServicio>
               <v12:versionServicio>?</v12:versionServicio>
            </v11:servicio>
            <v11:operacionCanal>
               <v13:idSesion>?</v13:idSesion>
               <v13:idTransaccion>?</v13:idTransaccion>
               <v13:fecOperacion>?</v13:fecOperacion>
               <v13:valJornada>?</v13:valJornada>
               <v13:codMoneda>?</v13:codMoneda>
               <v13:codPais>?</v13:codPais>
               <v13:codIdioma>?</v13:codIdioma>
            </v11:operacionCanal>
            <v11:consumidor>
               <v14:idConsumidor>?</v14:idConsumidor>
               <v14:aplicacion>
                  <v15:idAplicacion>?</v15:idAplicacion>
               </v14:aplicacion>
               <v14:canal>
                  <v16:idCanal>?</v16:idCanal>
                  <v16:idHost>?</v16:idHost>
               </v14:canal>
               <v14:terminal>
                  <v17:idTerminal>?</v17:idTerminal>
                  <v17:valOrigenPeticion>?</v17:valOrigenPeticion>
                  <v17:codUsuario>?</v17:codUsuario>
                  <v17:valPerfil>?</v17:valPerfil>
               </v14:terminal>
            </v11:consumidor>
            <!--Optional:-->
            <v11:huellaDigitalDispositivo>
               <!--Optional:-->
               <v18:idBeacon>?</v18:idBeacon>
               <!--Optional:-->
               <v18:valHuellaDispositivo>?</v18:valHuellaDispositivo>
               <!--Optional:-->
               <v18:valTokenCookie>?</v18:valTokenCookie>
               <!--Optional:-->
               <v18:valTokenFSO>?</v18:valTokenFSO>
               <!--Optional:-->
               <v18:valHttpAccept>?</v18:valHttpAccept>
               <!--Optional:-->
               <v18:valHttpAcceptChars>?</v18:valHttpAcceptChars>
               <!--Optional:-->
               <v18:valHttpAcceptEncoding>?</v18:valHttpAcceptEncoding>
               <!--Optional:-->
               <v18:valHttpAcceptLanguage>?</v18:valHttpAcceptLanguage>
               <!--Optional:-->
               <v18:valHttpReferrer>?</v18:valHttpReferrer>
               <!--Optional:-->
               <v18:valIpAddress>?</v18:valIpAddress>
               <!--Optional:-->
               <v18:valUserAgent>?</v18:valUserAgent>
            </v11:huellaDigitalDispositivo>
            <v11:criteriosOrdenamiento>
               <!--Zero or more repetitions:-->
               <v11:criterioOrdenamiento>
                  <!--Optional:-->
                  <v19:valColumna>?</v19:valColumna>
                  <!--Optional:-->
                  <v19:valOrden>?</v19:valOrden>
               </v11:criterioOrdenamiento>
            </v11:criteriosOrdenamiento>
            <!--Optional:-->
            <v11:paginacion>
               <!--Optional:-->
               <v110:valCantidadRegistrosLote>?</v110:valCantidadRegistrosLote>
               <!--Optional:-->
               <v110:valNumeroLote>?</v110:valNumeroLote>
               <!--Optional:-->
               <v110:valTotalRegistros>?</v110:valTotalRegistros>
            </v11:paginacion>
         </v1:contextoSolicitud>
         <v1:dataMail>
            <v1:tipoNotificacion>?</v1:tipoNotificacion>
            <v1:destino>
               <v1:cliente>
                  <v111:codTipoIdentificacion>?</v111:codTipoIdentificacion>
                  <v111:valNumeroIdentificacion>?</v111:valNumeroIdentificacion>
                  <v111:valNombre>?</v111:valNombre>
                  <!--Optional:-->
                  <v111:contacto>
                     <v112:telefonos>
                        <!--Zero or more repetitions:-->
                        <v112:telefono>
                           <v113:codTipoTelefono>?</v113:codTipoTelefono>
                           <v113:valNumeroTelefono>?</v113:valNumeroTelefono>
                        </v112:telefono>
                     </v112:telefonos>
                     <v112:correosElectronicos>
                        <!--Zero or more repetitions:-->
                        <v112:valCorreoElectronico>?</v112:valCorreoElectronico>
                     </v112:correosElectronicos>
                     <!--Optional:-->
                     <v112:esAutorizaNotificacionElectronica>?</v112:esAutorizaNotificacionElectronica>
                     <v112:ubicaciones>
                        <!--Zero or more repetitions:-->
                        <v112:ubicacion>
                           <!--Optional:-->
                           <v114:municipio>
                              <!--Optional:-->
                              <v115:idMunicipio>?</v115:idMunicipio>
                              <!--Optional:-->
                              <v115:codMunicipio>?</v115:codMunicipio>
                              <!--Optional:-->
                              <v115:valNombre>?</v115:valNombre>
                              <v115:departamento>
                                 <!--Optional:-->
                                 <v116:idDepartamento>?</v116:idDepartamento>
                                 <!--Optional:-->
                                 <v116:codDepartamento>?</v116:codDepartamento>
                                 <!--Optional:-->
                                 <v116:valNombre>?</v116:valNombre>
                              </v115:departamento>
                           </v114:municipio>
                           <!--Optional:-->
                           <v114:valDireccion>?</v114:valDireccion>
                           <!--Optional:-->
                           <v114:codTipoDireccion>?</v114:codTipoDireccion>
                        </v112:ubicacion>
                     </v112:ubicaciones>
                  </v111:contacto>
                  <!--Optional:-->
                  <v111:valNaturaleza>?</v111:valNaturaleza>
                  <v117:valPrimerNombre>?</v117:valPrimerNombre>
                  <!--Optional:-->
                  <v117:valSegundoNombre>?</v117:valSegundoNombre>
                  <v117:valPrimerApellido>?</v117:valPrimerApellido>
                  <!--Optional:-->
                  <v117:valSegundoApellido>?</v117:valSegundoApellido>
                  <!--Optional:-->
                  <v117:codSexo>?</v117:codSexo>
                  <!--Optional:-->
                  <v117:codEstadoCivil>?</v117:codEstadoCivil>
                  <!--Optional:-->
                  <v117:valLoginAutoservicio>?</v117:valLoginAutoservicio>
                  <!--Optional:-->
                  <v117:codNivelEducativo>?</v117:codNivelEducativo>
                  <!--Optional:-->
                  <v117:valFechaNacimiento>?</v117:valFechaNacimiento>
                  <!--Optional:-->
                  <v118:codEmpresaAsociada>?</v118:codEmpresaAsociada>
                  <!--Optional:-->
                  <v118:valNombreEmpresaAsociada>?</v118:valNombreEmpresaAsociada>
               </v1:cliente>
               <!--Optional:-->
               <v1:valMail>?</v1:valMail>
            </v1:destino>
            <v1:mensaje>
               <v1:valAsunto>?</v1:valAsunto>
               <!--Optional:-->
               <v1:valContenido>?</v1:valContenido>
               <!--Optional:-->
               <v1:plantilla>
                  <v1:idPlantilla>?</v1:idPlantilla>
                  <!--1 or more repetitions:-->
                  <v1:parametrosPlantilla>
                     <v1:valNombre>?</v1:valNombre>
                     <v1:valValor>?</v1:valValor>
                  </v1:parametrosPlantilla>
               </v1:plantilla>
               <!--Optional:-->
               <v1:formato>?</v1:formato>
            </v1:mensaje>
            <!--Zero or more repetitions:-->
            <v1:adjuntos>
               <v1:valNombre>?</v1:valNombre>
               <v1:valContenido>cid:1254688922825</v1:valContenido>
               <v1:valTipo>?</v1:valTipo>
            </v1:adjuntos>
            <v1:isEsperaRespuesta>?</v1:isEsperaRespuesta>
         </v1:dataMail>
      </v1:msjSolOpEnviarMail>
   </soapenv:Body>
</soapenv:Envelope>