recursos/xml/RespNotificacionesMail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.davivienda.com/Notificaciones/SrvScnNotificacionesMail/v1" xmlns:v11="http://www.davivienda.com/Esquemas/Framework/ContextoRespuestaTipo/v1" xmlns:v12="http://www.davivienda.com/Esquemas/Framework/ResultadoTransaccionTipo/v1" xmlns:v13="http://www.davivienda.com/Esquemas/Framework/ErrorTipo/v1" xmlns:v14="http://www.davivienda.com/Esquemas/Framework/PaginacionTipo/v1" xmlns:v15="http://www.davivienda.com/Esquemas/Framework/PersonaTipo/v1" xmlns:v16="http://www.davivienda.com/Esquemas/Framework/ContactoTipo/v1" xmlns:v17="http://www.davivienda.com/Esquemas/Framework/TelefonoTipo/v1" xmlns:v18="http://www.davivienda.com/Esquemas/Framework/UbicacionPersonaTipo/v1" xmlns:v19="http://www.davivienda.com/Esquemas/Framework/MunicipioTipo/v1" xmlns:v110="http://www.davivienda.com/Esquemas/Framework/DepartamentoTipo/v1" xmlns:v111="http://www.davivienda.com/Esquemas/Persona/PersonaNaturalTipo/v1" xmlns:v112="http://www.davivienda.com/Esquemas/Persona/ClienteNaturalTipo/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:msjRespOpEnviarMail>
         <v1:contextoRespuesta>
            <v11:resultadoTransaccion>
               <v12:codEstadoTransaccion>?</v12:codEstadoTransaccion>
               <!--Optional:-->
               <v12:valCaracterAceptacion>?</v12:valCaracterAceptacion>
               <!--Optional:-->
               <v12:valNumeroAprobacion>?</v12:valNumeroAprobacion>
               <!--Optional:-->
               <v12:idTransaccion>?</v12:idTransaccion>
               <!--Optional:-->
               <v12:fecOperacion>?</v12:fecOperacion>
            </v11:resultadoTransaccion>
            <!--Optional:-->
            <v11:error>
               <v13:codMsjRespuesta>?</v13:codMsjRespuesta>
               <v13:valMsjRespuesta>?</v13:valMsjRespuesta>
               <!--Optional:-->
               <v13:codMsjRespuestaBackend>?</v13:codMsjRespuestaBackend>
               <!--Optional:-->
               <v13:valMsjRespuestaBackend>?</v13:valMsjRespuestaBackend>
            </v11:error>
            <!--Optional:-->
            <v11:paginacion>
               <!--Optional:-->
               <v14:valCantidadRegistrosLote>?</v14:valCantidadRegistrosLote>
               <!--Optional:-->
               <v14:valNumeroLote>?</v14:valNumeroLote>
               <!--Optional:-->
               <v14:valTotalRegistros>?</v14:valTotalRegistros>
            </v11:paginacion>
         </v1:contextoRespuesta>
         <v1:clienteNatural>
            <v15:codTipoIdentificacion>?</v15:codTipoIdentificacion>
            <v15:valNumeroIdentificacion>?</v15:valNumeroIdentificacion>
            <v15:valNombre>?</v15:valNombre>
            <!--Optional:-->
            <v15:contacto>
               <v16:telefonos>
                  <!--Zero or more repetitions:-->
                  <v16:telefono>
                     <v17:codTipoTelefono>?</v17:codTipoTelefono>
                     <v17:valNumeroTelefono>?</v17:valNumeroTelefono>
                  </v16:telefono>
               </v16:telefonos>
               <v16:correosElectronicos>
                  <!--Zero or more repetitions:-->
                  <v16:valCorreoElectronico>?</v16:valCorreoElectronico>
               </v16:correosElectronicos>
               <!--Optional:-->
               <v16:esAutorizaNotificacionElectronica>?</v16:esAutorizaNotificacionElectronica>
               <v16:ubicaciones>
                  <!--Zero or more repetitions:-->
                  <v16:ubicacion>
                     <!--Optional:-->
                     <v18:municipio>
                        <!--Optional:-->
                        <v19:idMunicipio>?</v19:idMunicipio>
                        <!--Optional:-->
                        <v19:codMunicipio>?</v19:codMunicipio>
                        <!--Optional:-->
                        <v19:valNombre>?</v19:valNombre>
                        <v19:departamento>
                           <!--Optional:-->
                           <v110:idDepartamento>?</v110:idDepartamento>
                           <!--Optional:-->
                           <v110:codDepartamento>?</v110:codDepartamento>
                           <!--Optional:-->
                           <v110:valNombre>?</v110:valNombre>
                        </v19:departamento>
                     </v18:municipio>
                     <!--Optional:-->
                     <v18:valDireccion>?</v18:valDireccion>
                     <!--Optional:-->
                     <v18:codTipoDireccion>?</v18:codTipoDireccion>
                  </v16:ubicacion>
               </v16:ubicaciones>
            </v15:contacto>
            <!--Optional:-->
            <v15:valNaturaleza>?</v15:valNaturaleza>
            <v111:valPrimerNombre>?</v111:valPrimerNombre>
            <!--Optional:-->
            <v111:valSegundoNombre>?</v111:valSegundoNombre>
            <v111:valPrimerApellido>?</v111:valPrimerApellido>
            <!--Optional:-->
            <v111:valSegundoApellido>?</v111:valSegundoApellido>
            <!--Optional:-->
            <v111:codSexo>?</v111:codSexo>
            <!--Optional:-->
            <v111:codEstadoCivil>?</v111:codEstadoCivil>
            <!--Optional:-->
            <v111:valLoginAutoservicio>?</v111:valLoginAutoservicio>
            <!--Optional:-->
            <v111:codNivelEducativo>?</v111:codNivelEducativo>
            <!--Optional:-->
            <v111:valFechaNacimiento>?</v111:valFechaNacimiento>
            <!--Optional:-->
            <v112:codEmpresaAsociada>?</v112:codEmpresaAsociada>
            <!--Optional:-->
            <v112:valNombreEmpresaAsociada>?</v112:valNombreEmpresaAsociada>
         </v1:clienteNatural>
         <!--Optional:-->
         <v1:codActivacion>?</v1:codActivacion>
         <v1:codTipoToken>?</v1:codTipoToken>
         <!--Optional:-->
         <v1:tipoAutenticacion>?</v1:tipoAutenticacion>
         <!--Optional:-->
         <v1:estadoClaveVirtual>?</v1:estadoClaveVirtual>
         <!--Optional:-->
         <v1:notificarAlCorreo>?</v1:notificarAlCorreo>
      </v1:msjRespOpEnviarMail>
   </soapenv:Body>
</soapenv:Envelope>